7767517
83 94
Input                    input.1                  0 1 input.1
Convolution              Conv_0                   1 1 input.1 249 0=16 1=3 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     Conv_2                   1 1 249 252 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              Conv_4                   1 1 252 255 0=32 1=1 5=1 6=512 9=1
ConvolutionDepthWise     Conv_6                   1 1 255 258 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              Conv_8                   1 1 258 261 0=32 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     Conv_10                  1 1 261 264 0=32 1=3 4=1 5=1 6=288 7=32 9=1
Convolution              Conv_12                  1 1 264 267 0=32 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     Conv_14                  1 1 267 270 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              Conv_16                  1 1 270 273 0=64 1=1 5=1 6=2048 9=1
ConvolutionDepthWise     Conv_18                  1 1 273 276 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_20                  1 1 276 279 0=64 1=1 5=1 6=4096 9=1
ConvolutionDepthWise     Conv_22                  1 1 279 282 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_24                  1 1 282 285 0=64 1=1 5=1 6=4096 9=1
Split                    splitncnn_0              1 4 285 285_splitncnn_0 285_splitncnn_1 285_splitncnn_2 285_splitncnn_3
Convolution              Conv_26                  1 1 285_splitncnn_3 518 0=8 1=1 5=1 6=512
Convolution              Conv_27                  1 1 518 290 0=16 1=3 4=1 5=1 6=1152 9=1
Convolution              Conv_29                  1 1 290 524 0=16 1=3 2=2 4=2 5=1 6=2304
Convolution              Conv_30                  1 1 285_splitncnn_2 527 0=8 1=1 5=1 6=512
Convolution              Conv_31                  1 1 527 297 0=16 1=3 4=1 5=1 6=1152 9=1
Convolution              Conv_33                  1 1 297 533 0=16 1=3 2=3 4=3 5=1 6=2304
Convolution              Conv_34                  1 1 285_splitncnn_1 536 0=8 1=1 5=1 6=512
Convolution              Conv_35                  1 1 536 304 0=12 1=3 4=1 5=1 6=864 9=1
Convolution              Conv_37                  1 1 304 307 0=16 1=3 4=1 5=1 6=1728 9=1
Convolution              Conv_39                  1 1 307 545 0=16 1=3 2=5 4=5 5=1 6=2304
Concat                   Concat_40                3 1 524 533 545 310
Convolution              Conv_41                  1 1 310 548 0=64 1=1 5=1 6=3072
Convolution              Conv_42                  1 1 285_splitncnn_0 551 0=64 1=1 5=1 6=4096
BinaryOp                 Add_45                   2 1 548 551 317
ReLU                     Relu_46                  1 1 317 318
Split                    splitncnn_1              1 4 318 318_splitncnn_0 318_splitncnn_1 318_splitncnn_2 318_splitncnn_3
ConvolutionDepthWise     Conv_47                  1 1 318_splitncnn_3 321 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_49                  1 1 321 324 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     Conv_51                  1 1 324 327 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_53                  1 1 327 330 0=128 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     Conv_55                  1 1 330 333 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_57                  1 1 333 336 0=128 1=1 5=1 6=16384 9=1
Split                    splitncnn_2              1 4 336 336_splitncnn_0 336_splitncnn_1 336_splitncnn_2 336_splitncnn_3
ConvolutionDepthWise     Conv_59                  1 1 336_splitncnn_3 339 0=128 1=3 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_61                  1 1 339 342 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     Conv_63                  1 1 342 345 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_65                  1 1 345 348 0=256 1=1 5=1 6=65536 9=1
Split                    splitncnn_3              1 3 348 348_splitncnn_0 348_splitncnn_1 348_splitncnn_2
ConvolutionDepthWise     Conv_67                  1 1 318_splitncnn_2 350 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_69                  1 1 350 351 0=8 1=1 5=1 6=512
Permute                  Transpose_70             1 1 351 352 0=3
ConvolutionDepthWise     Conv_71                  1 1 318_splitncnn_1 354 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_73                  1 1 354 355 0=4 1=1 5=1 6=256
Permute                  Transpose_74             1 1 355 356 0=3
ConvolutionDepthWise     Conv_75                  1 1 318_splitncnn_0 358 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_77                  1 1 358 359 0=20 1=1 5=1 6=1280
Permute                  Transpose_78             1 1 359 360 0=3
ConvolutionDepthWise     Conv_79                  1 1 336_splitncnn_2 362 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_81                  1 1 362 363 0=8 1=1 5=1 6=1024
Permute                  Transpose_82             1 1 363 364 0=3
ConvolutionDepthWise     Conv_83                  1 1 336_splitncnn_1 366 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_85                  1 1 366 367 0=4 1=1 5=1 6=512
Permute                  Transpose_86             1 1 367 368 0=3
ConvolutionDepthWise     Conv_87                  1 1 336_splitncnn_0 370 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_89                  1 1 370 371 0=20 1=1 5=1 6=2560
Permute                  Transpose_90             1 1 371 372 0=3
ConvolutionDepthWise     Conv_91                  1 1 348_splitncnn_2 374 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_93                  1 1 374 375 0=8 1=1 5=1 6=2048
Permute                  Transpose_94             1 1 375 376 0=3
ConvolutionDepthWise     Conv_95                  1 1 348_splitncnn_1 378 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_97                  1 1 378 379 0=4 1=1 5=1 6=1024
Permute                  Transpose_98             1 1 379 380 0=3
ConvolutionDepthWise     Conv_99                  1 1 348_splitncnn_0 382 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_101                 1 1 382 383 0=20 1=1 5=1 6=5120
Permute                  Transpose_102            1 1 383 384 0=3
Reshape                  Reshape_108              1 1 352 394 0=4 1=-1
Reshape                  Reshape_114              1 1 364 404 0=4 1=-1
Reshape                  Reshape_120              1 1 376 414 0=4 1=-1
Concat                   Concat_121               3 1 394 404 414 bbox
Reshape                  Reshape_127              1 1 356 425 0=2 1=-1
Reshape                  Reshape_133              1 1 368 435 0=2 1=-1
Reshape                  Reshape_139              1 1 380 445 0=2 1=-1
Concat                   Concat_140               3 1 425 435 445 446
Reshape                  Reshape_146              1 1 360 456 0=10 1=-1
Reshape                  Reshape_152              1 1 372 466 0=10 1=-1
Reshape                  Reshape_158              1 1 384 476 0=10 1=-1
Concat                   Concat_159               3 1 456 466 476 ldmks
Softmax                  Softmax_160              1 1 446 score 0=1 1=1
