7767517
41 47
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Convolution              conv_1                   1 1 1 2 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
ConvolutionDepthWise     convdwclip_0             1 1 2 3 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=3
Convolution              conv_2                   1 1 3 4 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_0              1 2 4 5 6
ConvolutionDepthWise     convdwclip_1             1 1 6 7 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=3
Convolution              conv_3                   1 1 7 8 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_0                    2 1 5 8 9 0=0
Pooling                  maxpool2d_15             1 1 9 10 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdwclip_2             1 1 10 11 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=3
Convolution              conv_4                   1 1 11 12 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_1              1 2 12 13 14
ConvolutionDepthWise     convdwclip_3             1 1 14 15 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=3
Convolution              conv_5                   1 1 15 16 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_1                    2 1 13 16 17 0=0
Pooling                  maxpool2d_16             1 1 17 18 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdwclip_4             1 1 18 19 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=3
Convolution              conv_6                   1 1 19 20 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Split                    splitncnn_2              1 2 20 21 22
ConvolutionDepthWise     convdwclip_5             1 1 22 23 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=3
Convolution              conv_7                   1 1 23 24 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_2                    2 1 21 24 25 0=0
Pooling                  maxpool2d_17             1 1 25 26 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Split                    splitncnn_3              1 2 26 27 28
ConvolutionDepthWise     convdwclip_6             1 1 28 29 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=3
Convolution              conv_8                   1 1 29 30 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_3                    2 1 27 30 31 0=0
Split                    splitncnn_4              1 2 31 32 33
ConvolutionDepthWise     convdwclip_7             1 1 33 34 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=3
Convolution              conv_9                   1 1 34 35 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_4                    2 1 32 35 36 0=0
Split                    splitncnn_5              1 2 36 37 38
ConvolutionDepthWise     convdwclip_8             1 1 38 39 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=3
Convolution              conv_10                  1 1 39 40 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_5                    2 1 37 40 41 0=0
Convolution              conv_11                  1 1 41 42 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
Convolution              convclip_0               1 1 42 43 0=1 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=9 9=3
Convolution              conv_13                  1 1 43 44 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4
Reshape                  view_29                  1 1 44 45 0=36
InnerProduct             fcsigmoid_0              1 1 45 out0 0=5 1=1 2=180 9=4
